In [1]:
import pandas as pd
import numpy as np

In [2]:
data = pd.read_csv("products.csv")
data

   ProductID ProductName     Category   Price
0        201      Laptop  Electronics  1200.0
1        202  Smartphone  Electronics   800.0
2        203      Tablet  Electronics   400.0
3        204     Monitor  Accessories   200.0
4        205    Keyboard  Accessories     NaN

In [3]:
data.shape

(5, 4)

In [4]:
data.head()

   ProductID ProductName     Category   Price
0        201      Laptop  Electronics  1200.0
1        202  Smartphone  Electronics   800.0
2        203      Tablet  Electronics   400.0
3        204     Monitor  Accessories   200.0
4        205    Keyboard  Accessories     NaN

In [5]:
data.tail()

   ProductID ProductName     Category   Price
0        201      Laptop  Electronics  1200.0
1        202  Smartphone  Electronics   800.0
2        203      Tablet  Electronics   400.0
3        204     Monitor  Accessories   200.0
4        205    Keyboard  Accessories     NaN

In [6]:
data.head(2)

   ProductID ProductName     Category   Price
0        201      Laptop  Electronics  1200.0
1        202  Smartphone  Electronics   800.0

In [8]:
data.tail(3)

   ProductID ProductName     Category  Price
2        203      Tablet  Electronics  400.0
3        204     Monitor  Accessories  200.0
4        205    Keyboard  Accessories    NaN

In [9]:
data.describe()

        ProductID        Price
count    5.000000     4.000000
mean   203.000000   650.000000
std      1.581139   443.471157
min    201.000000   200.000000
25%    202.000000   350.000000
50%    203.000000   600.000000
75%    204.000000   900.000000
max    205.000000  1200.000000

In [10]:
data.columns

Index(['ProductID', 'ProductName', 'Category', 'Price'], dtype='object')

In [11]:
data['ProductName']

0        Laptop
1    Smartphone
2        Tablet
3       Monitor
4      Keyboard
Name: ProductName, dtype: object

In [12]:
data[['ProductName', 'Category', 'Price']]

  ProductName     Category   Price
0      Laptop  Electronics  1200.0
1  Smartphone  Electronics   800.0
2      Tablet  Electronics   400.0
3     Monitor  Accessories   200.0
4    Keyboard  Accessories     NaN

In [13]:
data['Price'].max()

1200.0

In [14]:
data['Price'].min()

200.0

In [15]:
type[data['Category']]

type[0    Electronics
1    Electronics
2    Electronics
3    Accessories
4    Accessories
Name: Category, dtype: object]

In [16]:
data.loc()

In [17]:
data.isnull()

   ProductID  ProductName  Category  Price
0      False        False     False  False
1      False        False     False  False
2      False        False     False  False
3      False        False     False  False
4      False        False     False   True

In [18]:
new_data = data.dropna(axis = 0)
new_data

   ProductID ProductName     Category   Price
0        201      Laptop  Electronics  1200.0
1        202  Smartphone  Electronics   800.0
2        203      Tablet  Electronics   400.0
3        204     Monitor  Accessories   200.0

In [19]:
new_data = data.dropna(axis = 1)
new_data

   ProductID ProductName     Category
0        201      Laptop  Electronics
1        202  Smartphone  Electronics
2        203      Tablet  Electronics
3        204     Monitor  Accessories
4        205    Keyboard  Accessories

In [20]:
new_data = data.interpolate
new_data

<bound method NDFrame.interpolate of    ProductID ProductName     Category   Price
0        201      Laptop  Electronics  1200.0
1        202  Smartphone  Electronics   800.0
2        203      Tablet  Electronics   400.0
3        204     Monitor  Accessories   200.0
4        205    Keyboard  Accessories     NaN>

In [21]:
new_data = data.fillna(data['Price'].mean())
new_data

   ProductID ProductName     Category   Price
0        201      Laptop  Electronics  1200.0
1        202  Smartphone  Electronics   800.0
2        203      Tablet  Electronics   400.0
3        204     Monitor  Accessories   200.0
4        205    Keyboard  Accessories   650.0

In [22]:
new_data=data.fillna(method='ffill')
new_data

C:\Users\K Sai Prasanna\AppData\Local\Temp\ipykernel_416148\126269373.py:1: FutureWarning: DataFrame.fillna with 'method' is deprecated and will raise in a future version. Use obj.ffill() or obj.bfill() instead.
  new_data=data.fillna(method='ffill')

   ProductID ProductName     Category   Price
0        201      Laptop  Electronics  1200.0
1        202  Smartphone  Electronics   800.0
2        203      Tablet  Electronics   400.0
3        204     Monitor  Accessories   200.0
4        205    Keyboard  Accessories   200.0

In [23]:
new_data=data.fillna(method='bfill')
new_data

C:\Users\K Sai Prasanna\AppData\Local\Temp\ipykernel_416148\1407429032.py:1: FutureWarning: DataFrame.fillna with 'method' is deprecated and will raise in a future version. Use obj.ffill() or obj.bfill() instead.
  new_data=data.fillna(method='bfill')

   ProductID ProductName     Category   Price
0        201      Laptop  Electronics  1200.0
1        202  Smartphone  Electronics   800.0
2        203      Tablet  Electronics   400.0
3        204     Monitor  Accessories   200.0
4        205    Keyboard  Accessories     NaN

In [26]:
pd.get_dummies(data['Category'])

   Accessories  Electronics
0        False         True
1        False         True
2        False         True
3         True        False
4         True        False

In [27]:
data['new_col'] = data['ProductID'] + data['Price']
data

   ProductID ProductName     Category   Price  new_col
0        201      Laptop  Electronics  1200.0   1401.0
1        202  Smartphone  Electronics   800.0   1002.0
2        203      Tablet  Electronics   400.0    603.0
3        204     Monitor  Accessories   200.0    404.0
4        205    Keyboard  Accessories     NaN      NaN

In [28]:
new_data = data.groupby('Category')
new_data

In [29]:
new_data['Price'].max()

Category
Accessories     200.0
Electronics    1200.0
Name: Price, dtype: float64

In [31]:
new_data['Price'].sum()

Category
Accessories     200.0
Electronics    2400.0
Name: Price, dtype: float64

In [32]:
data.pivot_table(values='Price', index='ProductName', aggfunc='sum')

              Price
ProductName
Keyboard        0.0
Laptop       1200.0
Monitor       200.0
Smartphone    800.0
Tablet        400.0

In [33]:
data.replace({'Tablet', 'Tab'})

C:\Users\K Sai Prasanna\AppData\Local\Temp\ipykernel_416148\2644195816.py:1: FutureWarning: DataFrame.replace without 'value' and with non-dict-like 'to_replace' is deprecated and will raise in a future version. Explicitly specify the new values instead.
  data.replace({'Tablet', 'Tab'})

   ProductID ProductName     Category   Price  new_col
0        201      Laptop  Electronics  1200.0   1401.0
1        202  Smartphone  Electronics   800.0   1002.0
2        203      Tablet  Electronics   400.0    603.0
3        204     Monitor  Accessories   200.0    404.0
4        205    Keyboard  Accessories     NaN      NaN

In [34]:
data.drop_duplicates()

   ProductID ProductName     Category   Price  new_col
0        201      Laptop  Electronics  1200.0   1401.0
1        202  Smartphone  Electronics   800.0   1002.0
2        203      Tablet  Electronics   400.0    603.0
3        204     Monitor  Accessories   200.0    404.0
4        205    Keyboard  Accessories     NaN      NaN

In [35]:
data['Price'].value_counts()

Price
1200.0    1
800.0     1
400.0     1
200.0     1
Name: count, dtype: int64

In [36]:
data.pivot_table(values='Price', index='ProductID', aggfunc='sum')

            Price
ProductID
201        1200.0
202         800.0
203         400.0
204         200.0
205           0.0

In [37]:
new_data = (data['Price'] - data['Price'].mean()) / data['Price'].std()
new_data

0    1.240216
1    0.338241
2   -0.563735
3   -1.014722
4         NaN
Name: Price, dtype: float64

In [38]:
new_data = data['Price'].apply(np.log1p)
new_data

0    7.090910
1    6.685861
2    5.993961
3    5.303305
4         NaN
Name: Price, dtype: float64

In [39]:
data.to_csv('modified_products.csv')